![]()

# SQL - Podstawowy

_Mikołaj Leszczuk_

* Warunki rozbudowane – operacja `SELECT.. WHERE`
* Klauzula `TOP`
* Aliasy – zastępcze nazwy kolumn lub tabeli
* Funkcje grupujące
* Klauzula `DISTINCT`
* Funkcje daty
* Klauzula `GROUP BY`
* Zadania utrwalające 1

## Warunki rozbudowane – operacja `SELECT.. WHERE`

W kursie początkującym poznaliśmy już zapytanie `SELECT` oraz jego rozszerzenie o klauzulę `WHERE`. Tutaj, postaramy się rozszerzyć naszą wiedzę o inne operatory porównania używane w tej klauzuli.

### Operatory `AND`, `OR`, `NOT`

Dzięki nim możemy stworzyć złożone warunki logiczne. Są to odpowiedniki matematycznej koniunkcji, alternatywy i negacji.

* `AND`	– oba warunki muszą być spełnione
* `OR`	– wystarczy, że jeden będzie spełniony
* `NOT`	– negacja warunku

```sqlite
SELECT kolumna,kolumna,.. FROM tabela WHERE NOT kolumna=wartość AND kolumna=wartość OR kolumna=wartość;
```

Możliwe jest również używanie nawiasów w warunkach. Operatory w nawiasach są wykonywane jako pierwsze a następnie ich wynik jest przekazywany poza nawias.

#### Przykład

**Wybieramy dane użytkownika który ma na imię `Katarzyna` i mieszka w mieście `Lublin`**

Tabela **`Customer`**:

[02 SQL - Reset.ipynb](02%20SQL%20-%20Reset.ipynb)

In [ ]:
%LOAD CodeBrainers.db rw

In [ ]:
SELECT * FROM customer;

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name,city,date FROM customer WHERE name='Katarzyna' AND city='Lublin';

#### Ćwiczenie

**Wybierz wszystkie dane produktów z tabeli `Product`, których cena jest większa od `25` lub liczba sztuk jest nie mniejsza niż `5`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name,price,amount,date FROM product WHERE price>25 OR amount>=5;

### Operator `LIKE`

Umożliwia przeszukiwanie danych tekstowych na podstawie wzorca podanego w klauzuli warunkowej. Może być to zarówno dokładny ciąg poszukiwanych znaków jak i wyrażenie stworzone przy pomocy następujących symboli:

* Symbol `%` zastępuje dowolny ciąg znaków
* Symbol `_` zastępuje dowolny pojedynczy znak

```sqlite
SELECT kolumna,kolumna,.. FROM tabela WHERE kolumna LIKE 'wyrażenie';
```

#### Przykład

**Wybieramy dane użytkownika których imię rozpoczyna się literą `M`**

Tabela **`Customer`**:

In [ ]:
SELECT * FROM customer;

Zapytanie: i wynik zapytania:

In [ ]:
SELECT id,name,city,date FROM customer WHERE name LIKE 'M%';

#### Ćwiczenie

**Wybierz id, nazwę i cenę produktów z tabeli Product które zawierają w nazwie literę “`a`”**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name,price FROM product WHERE name LIKE '%a%';

### Operator `IN`

Operator `IN` sprawdza czy wartości z kolumny znajdują się w zbiorze podanym zaraz po klauzuli `IN`.

```sqlite
SELECT kolumna,kolumna,.. FROM tabela WHERE kolumna IN (element zb.,element zb.,..);
```

#### Przykład

**Wybieramy nazwy i ceny produktów których cena wynosi `60` lub `10` lub `25`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT name,price FROM product WHERE price IN (60,10,25);

#### Ćwiczenie

**Wybierz nazwę, cenę i liczbę produktów z tabeli `Product`, których liczba to `3`, `4`, `5` lub `6`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT name,price,amount FROM product WHERE amount IN (3,4,5,6);

### Operator `BETWEEN`

Operator `BETWEEN` sprawdza czy wartości z kolumny znajdują się w przedziale podanym zaraz po klauzuli `BETWEEN`.

```sqlite
SELECT kolumna,kolumna,.. FROM tabela WHERE kolumna BETWEEN wartość1 AND wartość2;
```

#### Przykład

**Wybieramy nazwę i cenę produktów których cena należy do przedziału `40` do `60`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT name,price FROM product WHERE price BETWEEN 40 AND 60;

### Operator `IS NULL`

Umożliwia wybranie rekordów ze względu na nie-przypisaną wartość w jednej z jego kolumn.

```sqlite
SELECT kolumna,kolumna,.. FROM tabela WHERE kolumna IS NULL;
```

## Klauzula `TOP`

Pozwala ona ograniczyć ilość wybieranych wierszy do podanej liczby. Umieszcza się ją bezpośrednio po instrukcji `SELECT`.

```sql
SELECT TOP liczba kolumna,kolumna,.. FROM tabela;
```

Możliwe jest również wybieranie części rekordów na podstawie procentowej.

Pomiędzy instrukcjami `TOP` i `PERCENT` musimy wstawić liczbę określającą ile procent wyników chcemy otrzymać oraz użyć sortowania `ORDER BY`.

```sql
SELECT TOP liczba PERCENT kolumna,kolumna,.. FROM tabela ORDER BY kolumna;
```

### Odpowiednik klauzuli `TOP` w MySQL i SQLite to klauzula `LIMIT`

Podobnie jak `TOP`, klauzula `LIMIT` zwróci nam podaną ilość oczekiwanych wyników, jednak w tym wypadku możemy podać również, od którego wiersza ma się to zwracanie rozpoczynać.

```sqlite
SELECT kolumna FROM tabela LIMIT od którego wiersza,liczba wierszy;
```

#### Przykład

**Wybieramy id, nazwę i cenę jednego produktu którego cena jest wyższa niż `20`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name,price FROM product WHERE price>20 LIMIT 1;

#### Ćwiczenie

**Wybierz id i imię `4` pierwszych klientów korzystając z klauzuli `LIMIT`**

Tabela **`Customer`**:

In [ ]:
SELECT * FROM customer;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name FROM customer LIMIT 0,4;

## Aliasy – zastępcze nazwy kolumn lub tabeli

Alias to nazwa zastępcza, którą możemy zdefiniować dla konkretnej kolumny lub tabeli na początku zapytania, a następnie używać w całym zapytaniu jako wygodniejsza (zazwyczaj dużo krótsza) nazwa.

Alias definiuje się używając klauzuli “`AS`” zaraz po nazwie kolumny lub tabeli w następujący sposób:

```sqlite
SELECT kolumna AS kol FROM tabela AS tab WHERE tab.kol=wartość;
```

Od momentu takiej definicji do kolumny kolumna wystarczy odwoływać się aliasem `kol` a tabeli tabela aliasem `tab`.

Do kolumny w konkretnej tabeli odwołujemy się za pomocą operatora kropki “`.`”. Jest to szczególnie istotne w zapytaniach, w których korzysta się z więcej niż jednej tabeli.

Aliasy znajdują praktyczne zastosowanie w bardziej złożonych zapytaniach np. Korzystających ze złączenia tabel czy podzapytania.

Korzystanie z aliasów przy łączeniu tabel zostanie omówione na poziomie zaawansowanym

## Funkcje grupujące

Są to funkcje umożliwiające wykonanie pożądanych operacji na całych tabelach lub tylko niektórych zbiorach danych, zwracające ogólne wyniki dotyczące np. liczebności czy średnich wartości.

### `COUNT()`

Zwraca liczbę przekazanych wartości. Jest to po prostu liczba elementów w podanym zbiorze

```sqlite
SELECT COUNT(kolumna) FROM tabela;
```

Może służyć do zliczenia ilości rekordów w tabeli.

#### Przykład

**Liczymy ile produktów jest w tabeli `Product`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT COUNT(name) FROM product;

### `SUM()`

Zwraca sumę wartości podanego zbioru

```sqlite
SELECT SUM(kolumna);
```

Musimy uważać aby argumentem były zawsze liczby.

#### Przykład

**Wybieramy sumę wszystkich sztuk z tabeli `Product`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT SUM(amount) FROM product;

#### Ćwiczenie

**Znajdź sumę cen jednostkowych wszystkich produktów**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT SUM(price) FROM product;

### `AVG()`

Zwraca średnią wartość z podanego zbioru

```sqlite
SELECT AVG(kolumna);
```

Musimy uważać aby argumentem były zawsze liczby.

#### Przykład

**Liczymy średnią cenę w tabeli `Product`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie:

In [ ]:
SELECT AVG(price) FROM product;

#### Ćwiczenie

**Oblicz średnią liczbę produktów z tabeli `Product`, których cena jest wyższa od `40`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT AVG(amount) FROM product WHERE price>40;

### `MIN()`

Zwraca najmniejszą wartość z podanego zbioru

```sqlite
SELECT MIN(kolumna);
```

Argumentami mogą być liczby, dane tekstowe i daty z czasem.

#### Przykład

**Wybieramy id i cenę produktu o najniższej cenie**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,MIN(price) FROM product;

### `MAX()`

Zwraca największą wartość z podanego zbioru

```sqlite
SELECT MAX(kolumna);
```

Argumentami mogą być liczby, dane tekstowe i daty z czasem.

## Klauzula `DISTINCT`

### Klauzula `DISTINCT`

Zwraca w wyniku rekordy bez powtórzeń

```sqlite
SELECT DISTINCT(kolumna) FROM tabela;
```

#### Przykład

**Zwracamy w wyniku miasta bez powtórzeń**

Tabela **`Customer`**:

In [ ]:
SELECT * FROM customer;

Zapytanie i wynik zapytania:

In [ ]:
SELECT DISTINCT city FROM customer;

### Użycie w agregatach

Może być także użyte w agregatach, np.:

```sqlite
SELECT COUNT(DISTINCT kolumna) FROM tabela;
```

#### Przykład

**Zwracamy w wyniku liczbę miast bez powtórzeń**

Tabela **`Customer`**:

In [ ]:
SELECT * FROM customer;

Zapytanie i wynik zapytania:

In [ ]:
SELECT COUNT(DISTINCT city) FROM customer;

## Funkcje daty

### Funkcje daty SQL

Umożliwiają operacje na dacie i czasie w trakcie wykonywania zapytania. Typowe funkcje to:

`DAY()`, `MONTH()`, `YEAR()`

Zwracają kolejno dzień, miesiąc, rok z podanej w argumencie daty

```sql
SELECT DAY(data);
```

### Funkcje daty SQLite

Umożliwiają operacje na dacie i czasie w trakcie wykonywania zapytania. Typowe funkcje to:

`strftime('%d')`, `strftime('%m')`, `strftime('%Y')`

Zwracają kolejno dzień, miesiąc, rok z podanej w argumencie daty

```sqlite
SELECT strftime('%d',data);
```

#### Przykład

**Wybieramy id, imiona i daty dodania klientów którzy zarejestrowali się w lutym!**

Tabela **`Customer`**:

In [ ]:
SELECT * FROM customer;

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name,date FROM customer WHERE STRFTIME('%m',date)='02';

#### Ćwiczenie

**Wybierz nazwę, cenę i datę dodania produktów z tabeli `Product`, których dzień dodania należy do przedziału od `1` do `10`**

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT name,price,date FROM product WHERE STRFTIME('%d',date) BETWEEN '01' AND '10';

### `GETDATE()`

Zwraca bieżącą datę i czas - SQL

```sql
SELECT GETDATE();
```

### `DATE('now')`

Zwraca bieżącą datę i czas - SQLite

```sqlite
SELECT DATE('now');
```

In [ ]:
SELECT DATE('now');

### `DATEDIFF()`

Zwraca liczbę podanych jednostek pomiędzy podanymi datami - SQL

```sql
SELECT DATEDIFF(DAY,'20110210','20110310');
```

### `JULIANDAY()-JULIANDAY()`

Zwraca liczbę podanych dni pomiędzy podanymi datami - SQLite

```sqlite
SELECT JULIANDAY('2011-02-10')-JULIANDAY('2011-03-10');
```

In [ ]:
SELECT JULIANDAY(DATE('now'));

In [ ]:
SELECT JULIANDAY('2011-02-10')-JULIANDAY('2011-03-10');

## Klauzula `GROUP BY`

Klauzula `GROUP BY` umożliwia wykonywanie funkcji grupujących na grupie wartości wyodrębnionych na podstawie wartości innej kolumny.

Aby użyć kolumny do grupowania, musimy pamiętać, aby umieścić ją w liście kolumn, zaraz po słowie `SELECT`. W przeciwnym razie nie będzie ona dostępna dla klauzuli grupującej `GROUP BY`.

```sqlite
SELECT SUM(kolumna),inna_kolumna FROM tabela GROUP BY inna_kolumna;
```

Oblicza agregaty - funkcje obliczane dla zbiorów wierszy.

Istnieje kilka agregatów:

* `COUNT()` - zlicza elementy
* `SUM()` - dodaje elementy
* `MIN()`, `MAX()`, `AVG()` - obliczają odpowiednio wartość najmniejszą, największą i średnią

Dodatkowa baza danych do zaimportowania w programie DB Browser znajduje się w plikach [`simple_library_db.csv`](https://github.com/pkociepka/sql/blob/master/simple_library_db.csv) oraz [`library_db.sql`](https://github.com/pkociepka/sql/blob/master/library_db.sql)

Schemat bazy danych z pliku [`library_db.sql`](https://github.com/pkociepka/sql/blob/master/library_db.sql) znajdziesz w pliku [`library_db_scheme.png`](https://github.com/pkociepka/sql/blob/master/library_db_schema.png)

![](https://raw.githubusercontent.com/pkociepka/sql/master/library_db_schema.png)

#### Przykład

**Chcemy policzyć książki napisane przez każdego autora**

Tabela **`Titles`**:

In [ ]:
%LOAD library_db.db rw

In [ ]:
SELECT * FROM titles;

Zapytanie i wynik zapytania:

In [ ]:
SELECT author_id,COUNT(title) FROM titles GROUP BY author_id;

#### Ćwiczenie

**Podaj nazwy miast wraz z sumaryczną liczbą ich wystąpień**

Tabela **`Customer`**:

In [ ]:
%LOAD CodeBrainers.db rw

In [ ]:
SELECT * FROM customer;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT city,COUNT(city) FROM customer GROUP BY city;

#### Ćwiczenie

**Podaj łączną liczbę możliwych do wypożyczenia książek każdego autora**

Tabela **`Simple_library_db`**:

In [ ]:
%LOAD simple_library_db.db rw

In [ ]:
SELECT * FROM simple_library_db;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT Author_surname,COUNT(Author_surname) FROM simple_library_db GROUP BY Author_surname;

#### Ćwiczenie

**Podaj łączną liczbę tytułów każdego autora**

Tabela **`Simple_library_db`**:

In [ ]:
SELECT * FROM simple_library_db;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT author_surname,COUNT(DISTINCT title) FROM simple_library_db GROUP BY author_surname;

#### Ćwiczenie

**Oblicz liczbę książek pożyczonych przez każdego z użytkowników**

Tabela **`Borrowings`**:

In [ ]:
%LOAD library_db.db rw

In [ ]:
SELECT * FROM borrowings;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT user_id,COUNT(book_id) FROM borrowings GROUP BY user_id ORDER BY user_id;

Klauzula `HAVING`, znajdująca się zaraz po `GROUP BY`, służy do określania dodatkowych kryteriów przy grupowaniu (jest to odpowiednik warunku `WHERE` w zapytaniach bez funkcji grupujących).

```sqlite
SELECT SUM(kolumna) FROM tabela GROUP BY inna kolumna HAVING SUM(kolumna)>wartość;
```

`HAVING` filtruje rekordy na podstawie wartości agregatów - analogicznie jak `WHERE` filtruje na podstawie wartości pojedynczych pól

#### Przykład

**Chcemy policzyć książki napisane przez każdego autora, który ma ponad pięć książek**

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Zapytanie i wynik zapytania:

In [ ]:
SELECT author_id,COUNT(title) FROM titles GROUP BY author_id HAVING COUNT(title)>5;

#### Ćwiczenie

**Podaj nazwy miast wraz z sumaryczną liczbą ich wystąpień, ale tylko takich, które występują więcej niż jeden raz**

Tabela **`Customer`**:

In [ ]:
%LOAD CodeBrainers.db rw

In [ ]:
SELECT * FROM customer;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT city,COUNT(city) FROM customer GROUP BY city HAVING COUNT(city)>1;

#### Ćwiczenie

**Podaj id produktów z tabeli Order_product wraz z liczbą wszystkich zamówionych sztuk, jeśli liczba ta należy do zbioru {2,4}**

Tabela **`Order_product`**:

In [ ]:
SELECT * FROM order_product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT product_id,SUM(amount) FROM order_product GROUP BY product_id HAVING SUM(amount) IN (2,4);

## Zadania utrwalające 1

### Ćwiczenia

[`01_simple_querries.md`](https://github.com/pkociepka/sql/blob/master/exercises/01_simple_querries.md)

### Materiały

[`simple_library_db.csv`](https://github.com/pkociepka/sql/blob/master/simple_library_db.csv)